Tekla.Structures.Dialog.UIControls.OkApplyCancel
The OkApplyCancel class represents a control including the Ok-Apply-Cancel button group.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.#ctor
Initializes a new instance of the OkApplyCancel class.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.OnLoad(System.EventArgs)
Localizes the control when loaded.
Exc: The event arguments.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.OkClicked
The OkClicked event is raised when the Ok button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.ApplyClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.OkApplyCancel.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.